---
kind: method
id: M:Autodesk.Revit.DB.LinkLoadResult.#ctor(Autodesk.Revit.DB.LinkLoadResult)
source: html/8316dd19-1180-db11-1271-ae458c6bba08.htm
---
# Autodesk.Revit.DB.LinkLoadResult.#ctor Method

Constructs a new copy of the input LinkLoadResult object.

## Syntax (C#)
```csharp
public LinkLoadResult(
	LinkLoadResult other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.LinkLoadResult`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null